Revit 2027 API
ParameterDownloadOptions.GetGroupTypeId Method
 Get properties palette group identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetGroupTypeId()
Public Function GetGroupTypeId As ForgeTypeId
public:
ForgeTypeId^ GetGroupTypeId()
member GetGroupTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace